src/cf/Documents/РаспределениеЗатратНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РаспределениеЗатратНаПроизводство</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗатратыНаПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыНераспределенные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подвид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подвиды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийАвтор</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Готовая продукция выпущенная за указанный период</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Издержки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставИздержек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДолиРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доля</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ВыпускПродукцииУслугБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ВыпускПродукцииУслугБухгалтерскийУчет</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСписания1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСписания2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСписания3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрямыеРасходыРаспределятьПоКоличеству</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ЗатратыНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ЗатратыНаПроизводство</Name>
			<Comment>Затраты прямые</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплектующая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаКомплектующей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Comment>План\Факт</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПланФакт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/РаспределениеЗатратНаПроизводство/Ext/ObjectModule.bsl
Функция ПолучитьОборотВыпускаПродукции()
	Запрос=Новый Запрос; стрПериод=СокрЛП(Перечисления.Периодичность.Месяц);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаКонца", КонецМесяца(Дата));
	Если Период=Перечисления.Периодичность.Квартал Тогда
		Запрос.УстановитьПараметр("ДатаНачала", НачалоКвартала(Дата));
		Запрос.УстановитьПараметр("ДатаКонца", КонецКвартала(Дата));
		стрПериод="Квартал";
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Статус", Перечисления.ПланФакт.Факт);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ИсточникДанных.Организация,
	|	ИсточникДанных.Продукция КАК Номенклатура,
	|	ИсточникДанных.ХарактеристикаНоменклатуры,
	|	ИсточникДанных.Подразделение КАК ЦФО,
	|	ИсточникДанных.ПлановаяСтоимостьОборот Как Стоимость,
	|	ИсточникДанных.КоличествоОборот Как Количество
	|ИЗ
	|	РегистрНакопления.ВыпускПродукцииУслугБухгалтерскийУчет.Обороты(&ДатаНачала,&ДатаКонца, "+стрПериод+", Организация=&Организация) КАК ИсточникДанных
	|";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьОборотЗатратНаПродукцию()
	Запрос=Новый Запрос; стрПериод=СокрЛП(Перечисления.Периодичность.Месяц);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаКонца", КонецМесяца(Дата));
	Если Период=Перечисления.Периодичность.Квартал Тогда
		Запрос.УстановитьПараметр("ДатаНачала", НачалоКвартала(Дата));
		Запрос.УстановитьПараметр("ДатаКонца", КонецКвартала(Дата));
		стрПериод="Квартал";
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Статус", Перечисления.ПланФакт.Факт);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ИсточникДанных.Организация,
	|	ИсточникДанных.Номенклатура,
	|	ИсточникДанных.ХарактеристикаНоменклатуры,
	|	ИсточникДанных.ЦФО,
	|	ИсточникДанных.СтатьяЗатрат.РазделЗатрат Как ВидЗатрат,
	|	ИсточникДанных.СтоимостьОборот Как Стоимость
	|ИЗ
	|	РегистрНакопления.ЗатратыНаПроизводство.Обороты(&ДатаНачала,&ДатаКонца, "+стрПериод+", Организация=&Организация) КАК ИсточникДанных
	|";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураТабличныхЧастей, Отказ)
	тзИздержки=СтруктураТабличныхЧастей.Издержки;
	тзСоставИздержек=СтруктураТабличныхЧастей.СоставИздержек;
	тзДолиРаспределения=СтруктураТабличныхЧастей.ДолиРаспределения;
	тзТовары=СтруктураТабличныхЧастей.Товары;

	тзВыпускПродукции=ПолучитьОборотВыпускаПродукции();
	тзЗатратыНаПродукцию=ПолучитьОборотЗатратНаПродукцию();
	
	тзДвижения_ЗатратыНаПроизводство=Движения.ЗатратыНаПроизводство.ВыгрузитьКолонки();
	тзДвижения_ЗатратыНераспределенные=Движения.ЗатратыНераспределенные.ВыгрузитьКолонки();

	прчБаза=Перечисления.БазыРаспределенияКосвенныхРасходов;
	
	Для каждого СтрокаТабличнойЧасти_Издержки Из тзИздержки Цикл
		СтруткураОтбора=Новый Структура("ID", СтрокаТабличнойЧасти_Издержки.ID);

		МассивСтрок_СоставИздержки=тзСоставИздержек.НайтиСтроки(СтруткураОтбора);
		Для каждого СтрокаТабличнойЧасти_СоставИздержки Из МассивСтрок_СоставИздержки Цикл
			текВариантРаспределения=СтрокаТабличнойЧасти_Издержки.ВариантРаспределения;
			Если Не СтрокаТабличнойЧасти_СоставИздержки.ВариантРаспределения.Пустая() Тогда
				текВариантРаспределения=СтрокаТабличнойЧасти_СоставИздержки.ВариантРаспределения;
			КонецЕсли;

			Если текВариантРаспределения=прчБаза.ОбъемВыпуска Тогда
				тзБаза=тзВыпускПродукции.Скопировать();
				тзБаза.Колонки.Добавить("СтатьяЗатрат");
				УправлениеКоллекциямиЗначенийСервер.РаспределитьПоТаблицеЗначений(тзБаза, СтрокаТабличнойЧасти_СоставИздержки.Стоимость, "Количество", 1, "Стоимость");

			ИначеЕсли текВариантРаспределения=прчБаза.МатериальныеЗатраты Тогда
				спОтбор=Новый СписокЗначений;
				спОтбор.Добавить(Справочники.КлассификаторПеречислений.РазделыЗатрат_ОсновныеМатериалы);
				спОтбор.Добавить(Справочники.КлассификаторПеречислений.РазделыЗатрат_ВспомогательныеМатериалы);
				СтруктураКритериев=Новый Структура("ВидЗатрат", спОтбор);
				СтруктураСложныхКритериев=Новый Структура("ВидЗатрат", ВидСравнения.ВСписке);
				тзБаза=ОбщегоНазначения.ОтобратьСтрокиПоКритериям(тзЗатратыНаПродукцию, СтруктураКритериев, СтруктураСложныхКритериев).Выгрузить();
				УправлениеКоллекциямиЗначенийСервер.РаспределитьПоТаблицеЗначений(тзБаза, СтрокаТабличнойЧасти_СоставИздержки.Стоимость, "Стоимость", 1);

			ИначеЕсли текВариантРаспределения=прчБаза.ПрямыеЗатраты Тогда
				тзБаза=тзЗатратыНаПродукцию.Скопировать();
				УправлениеКоллекциямиЗначенийСервер.РаспределитьПоТаблицеЗначений(тзБаза, СтрокаТабличнойЧасти_СоставИздержки.Стоимость, "Стоимость", 1);

			ИначеЕсли текВариантРаспределения=прчБаза.НеРаспределяется Тогда //Долевое распределение
				тзБаза=тзЗатратыНаПродукцию.Скопировать();
				Для каждого СтрокаКоллекции Из тзБаза Цикл
					СтруктураОтбора=Новый Структура;
					СтруктураОтбора.Вставить("Номенклатура", СтрокаКоллекции.Номенклатура);
					СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры", СтрокаКоллекции.ХарактеристикаНоменклатуры);
					МассивСтрок=тзДолиРаспределения.НайтиСтроки(СтруктураОтбора);
					Если МассивСтрок.Количество()=0 Тогда
						СтрокаКоллекции.Стоимость=0;
					Иначе
						СтрокаКоллекции.Стоимость=МассивСтрок[0].Доля;
					КонецЕсли;
				КонецЦикла;
				УправлениеКоллекциямиЗначенийСервер.РаспределитьПоТаблицеЗначений(тзБаза, СтрокаТабличнойЧасти_СоставИздержки.Стоимость, "Стоимость", 1);
			КонецЕсли;

			//Затраты на производство
			Для каждого СтрокаКоллекции Из тзБаза Цикл
				НоваяСтрока=тзДвижения_ЗатратыНаПроизводство.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоллекции);
				НоваяСтрока.СтатьяЗатрат=СтрокаТабличнойЧасти_Издержки.СтатьяЗатрат;
				НоваяСтрока.Количество=0;
			КонецЦикла;
			//Затраты нераспределенные
			НоваяСтрока=тзДвижения_ЗатратыНераспределенные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти_СоставИздержки);
			НоваяСтрока.СтатьяЗатрат=СтрокаТабличнойЧасти_Издержки.СтатьяЗатрат;
		КонецЦикла;
	КонецЦикла;

	//Движения по регистру "Затраты на производство"
	Если тзДвижения_ЗатратыНаПроизводство.Количество()>0 Тогда
		тзДвижения_ЗатратыНаПроизводство.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СтатьяЗатрат,ЦФО", "Количество,Стоимость");
		тзДвижения_ЗатратыНаПроизводство.Колонки.Добавить("Период");
		тзДвижения_ЗатратыНаПроизводство.Колонки.Добавить("Активность");
		тзДвижения_ЗатратыНаПроизводство.Колонки.Добавить("Регистратор");
		тзДвижения_ЗатратыНаПроизводство.Колонки.Добавить("Организация");
		тзДвижения_ЗатратыНаПроизводство.Колонки.Добавить("Статус");
		тзДвижения_ЗатратыНаПроизводство.ЗаполнитьЗначения(Дата, "Период");
		тзДвижения_ЗатратыНаПроизводство.ЗаполнитьЗначения(Истина, "Активность");
		тзДвижения_ЗатратыНаПроизводство.ЗаполнитьЗначения(Ссылка, "Регистратор");
		тзДвижения_ЗатратыНаПроизводство.ЗаполнитьЗначения(Организация, "Организация");
		тзДвижения_ЗатратыНаПроизводство.ЗаполнитьЗначения(Перечисления.ПланФакт.Факт, "Статус");
		Движения.ЗатратыНаПроизводство.Загрузить(тзДвижения_ЗатратыНаПроизводство);
	КонецЕсли;

	//Движения по регистру "Затраты нераспределенные"
	Если тзДвижения_ЗатратыНераспределенные.Количество()>0 Тогда
		тзДвижения_ЗатратыНераспределенные.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СтатьяЗатрат,ЦФО", "Количество,Стоимость");
		тзДвижения_ЗатратыНераспределенные.Колонки.Добавить("Период");
		тзДвижения_ЗатратыНераспределенные.Колонки.Добавить("Активность");
		тзДвижения_ЗатратыНераспределенные.Колонки.Добавить("Регистратор");
		тзДвижения_ЗатратыНераспределенные.Колонки.Добавить("Организация");
		тзДвижения_ЗатратыНераспределенные.Колонки.Добавить("ВидДвижения");
		тзДвижения_ЗатратыНераспределенные.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
		тзДвижения_ЗатратыНераспределенные.ЗаполнитьЗначения(Дата, "Период");		
		тзДвижения_ЗатратыНераспределенные.ЗаполнитьЗначения(Истина, "Активность");
		тзДвижения_ЗатратыНераспределенные.ЗаполнитьЗначения(Ссылка, "Регистратор");
		тзДвижения_ЗатратыНераспределенные.ЗаполнитьЗначения(Организация, "Организация");		
		Движения.ЗатратыНераспределенные.Загрузить(тзДвижения_ЗатратыНераспределенные);
	КонецЕсли;
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий модуля

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;
	СуммаДокумента=Издержки.Итог("Стоимость");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УправлениеДокументамиСервер.ПередПроведением(Отказ, РежимПроведения, ЭтотОбъект);
	Если Отказ Тогда Возврат; КонецЕсли; 

	СтруктураТЧ=Новый Структура;
	СтруктураТЧ.Вставить("Издержки", Издержки.Выгрузить());
	СтруктураТЧ.Вставить("СоставИздержек", СоставИздержек.Выгрузить());
	СтруктураТЧ.Вставить("ДолиРаспределения", ДолиРаспределения.Выгрузить());
	СтруктураТЧ.Вставить("Товары", Товары.Выгрузить());

	ДвиженияПоРегистрам(РежимПроведения, СтруктураТЧ, Отказ);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Операторы основной программы

УправлениеДокументамиСервер.ИнициализацияМодуля(ДополнительныеСвойства);
